---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.Camera.Transform(Autodesk.Revit.DB.Transform)
zh: 变换
source: html/55d95805-c475-dc0a-ef47-ff2b9d19f8b6.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.Transform Method

**中文**: 变换

Transforms the camera

## Syntax (C#)
```csharp
public void Transform(
	Transform trf
)
```

## Parameters
- **trf** (`Autodesk.Revit.DB.Transform`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null